Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresFiles Methods
The TeklaStructuresFiles type exposes the following members.
Methods
Name | Description
GetAttributeFile(String)
 Gets a file info representing the first match in the standard property file directories.
GetAttributeFile(List<String>, String)
 Gets a file info representing the first match in the search directories.
GetFileDictionaryByExtension
 Retrieves a dictionary of file names and their corresponding paths from multiple directories.
GetMultiDirectoryFileList
 Gets a list of files with the given extension from the default search directories.
Top
See Also
Reference
TeklaStructuresFiles Class
Tekla.Structures Namespace